use mermaid images in docs
